In [2]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [3]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

In [4]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [5]:
right_table = {'CountryID': [3,4],
              'Country': ['Pandama', 'Spain']}

In [6]:
right_table_df = pd.DataFrame(right_table)
right_table_df

   CountryID  Country
0          3  Pandama
1          4    Spain

In [7]:
inner_join = left_table_df.merge(right_table_df,on='CountryID')

In [8]:
inner_join

         Date  CountryID  Units  Country
0  03-01-2020          3     30  Pandama

In [9]:
right_table = {'ID': [3,4],
              'Country': ['Pandama', 'Spain']}

In [10]:
right_table_df = pd.DataFrame(right_table)
right_table_df

   ID  Country
0   3  Pandama
1   4    Spain

In [11]:
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [12]:
inner_join=left_table_df.merge(right_table_df,left_on='CountryID',right_on='ID')
inner_join

         Date  CountryID  Units  ID  Country
0  03-01-2020          3     30   3  Pandama

In [13]:
inner_join=left_table_df.merge(right_table_df,left_on='CountryID',right_on='ID').drop(['ID','Units'],axis=1)
inner_join

         Date  CountryID  Country
0  03-01-2020          3  Pandama

In [14]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]
             }

In [15]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [16]:
right_table_df

   ID  Country
0   3  Pandama
1   4    Spain

In [17]:
inner_join=left_table_df.merge(right_table_df,left_on='CountryID',right_on='ID',suffixes=['_left','_right']).drop('ID',axis=1)
inner_join

         Date  CountryID  Units  Country
0  03-01-2020          3     30  Pandama

LEFT_JOIN

In [18]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]
             }
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [19]:
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [20]:
right_table = {'ID': [1,2, 3],
              'Country': ['USA', 'Canada', 'Panama']}
right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   1     USA
1   2  Canada
2   3  Panama

In [21]:
left_join=left_table_df.merge(right_table_df,left_on='CountryID',right_on='ID',how='left')

In [22]:
left_join

         Date  CountryID  Units  ID Country
0  01-01-2020          1     40   1     USA
1  02-01-2020          1     25   1     USA
2  03-01-2020          3     30   3  Panama
3  04-01-2020          2     35   2  Canada

In [23]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,4],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          4     35

In [24]:
right_table = {'ID': [3],
              'Country': ['Pandama']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID  Country
0   3  Pandama

In [27]:
right_join= left_table_df.merge(right_table_df,left_on='CountryID',right_on='ID',how='right').drop('ID',axis=1)
right_join

         Date  CountryID  Units  ID  Country
0  03-01-2020          3     30   3  Pandama

FULL/OUTER JOIN

In [31]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020','05-03-2025' ],
              'CountryID': [1,1,3,2,5],
              'Units': [40, 25, 30, 35,45]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35
4  05-03-2025          5     45

In [32]:
right_table = {'ID': [1,2,3,4],
              'Country': ['USA', 'Canada', 'Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   1     USA
1   2  Canada
2   3  Panama
3   4   Spain

In [34]:
outer_join = left_table_df.merge(right_table_df,left_on='CountryID',right_on='ID',how='outer').drop('ID',axis=1)
outer_join

         Date  CountryID  Units Country
0  01-01-2020        1.0   40.0     USA
1  02-01-2020        1.0   25.0     USA
2  04-01-2020        2.0   35.0  Canada
3  03-01-2020        3.0   30.0  Panama
4         NaN        NaN    NaN   Spain
5  05-03-2025        5.0   45.0     NaN

LEFT ANTI JOIN

In [35]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [36]:
right_table = {'ID': [3,4],
              'Country': ['Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   3  Panama
1   4   Spain

In [38]:
left_join= left_table_df.merge(right_table_df,left_on='CountryID',right_on='ID',how='left')
left_join

         Date  CountryID  Units   ID Country
0  01-01-2020          1     40  NaN     NaN
1  02-01-2020          1     25  NaN     NaN
2  03-01-2020          3     30  3.0  Panama
3  04-01-2020          2     35  NaN     NaN

In [42]:
left_join= left_table_df.merge(right_table_df,left_on='CountryID',right_on='ID',how='left')
left_join[left_join['Country'].isna()][['Date','CountryID','Units']]

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
3  04-01-2020          2     35

In [43]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [44]:
right_table = {'ID': [3,4],
              'Country': ['Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   3  Panama
1   4   Spain

In [56]:
left_anti_df=left_table_df.merge(right_table_df,left_on='CountryID',right_on='ID',how='left',indicator=True)
left_anti_df

         Date  CountryID  Units   ID Country     _merge
0  01-01-2020          1     40  NaN     NaN  left_only
1  02-01-2020          1     25  NaN     NaN  left_only
2  03-01-2020          3     30  3.0  Panama       both
3  04-01-2020          2     35  NaN     NaN  left_only

In [55]:
left_anti_df.iloc[left_anti_df[]]#.drop(['ID','Country'],axis=1)

         Date  CountryID  Units     _merge
0  01-01-2020          1     40  left_only
1  02-01-2020          1     25  left_only
3  04-01-2020          2     35  left_only

In [51]:
left_anti_df = left_anti_df[['Date','CountryID','Units','_merge']]

In [52]:
left_anti_df

         Date  CountryID  Units     _merge
0  01-01-2020          1     40  left_only
1  02-01-2020          1     25  left_only
2  03-01-2020          3     30       both
3  04-01-2020          2     35  left_only

Right Anti join

In [58]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [59]:
right_table = {'ID': [3,4],
              'Country': ['Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   3  Panama
1   4   Spain

In [66]:
right_join = left_table_df.merge(right_table_df,left_on='CountryID',right_on='ID',how='right',indicator=True)
right_join

         Date  CountryID  Units  ID Country      _merge
0  03-01-2020        3.0   30.0   3  Panama        both
1         NaN        NaN    NaN   4   Spain  right_only

CONCATENATION

In [57]:
left_anti_df

         Date  CountryID  Units   ID Country     _merge
0  01-01-2020          1     40  NaN     NaN  left_only
1  02-01-2020          1     25  NaN     NaN  left_only
2  03-01-2020          3     30  3.0  Panama       both
3  04-01-2020          2     35  NaN     NaN  left_only

In [67]:
right_join

         Date  CountryID  Units  ID Country      _merge
0  03-01-2020        3.0   30.0   3  Panama        both
1         NaN        NaN    NaN   4   Spain  right_only

In [69]:
pd.concat([left_anti_df,right_join],ignore_index=True)

         Date  CountryID  Units   ID Country      _merge
0  01-01-2020        1.0   40.0  NaN     NaN   left_only
1  02-01-2020        1.0   25.0  NaN     NaN   left_only
2  03-01-2020        3.0   30.0  3.0  Panama        both
3  04-01-2020        2.0   35.0  NaN     NaN   left_only
4  03-01-2020        3.0   30.0  3.0  Panama        both
5         NaN        NaN    NaN  4.0   Spain  right_only